{"format": "graph-model", "generatedBy": "2.7.0", "convertedBy": "TensorFlow.js Converter v3.11.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}}, "outputs": {"reshape": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}, {"size": "128"}, {"size": "128"}]}}}}, "modelTopology": {"node": [{"name": "unknown_23", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/tf.concat/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_30", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/tf.concat_1/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_37", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/tf.concat_2/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_44", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_7/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_7/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/Reshape/shape/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "128"}, {"size": "128"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_6/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "112"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_1/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_1/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_6/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_2/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_2/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_3/Conv2D_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_3/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_4/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "192"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_4/Conv2D_bn_offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_5/Conv2D_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "224"}, {"size": "96"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_5/Conv2D_bn_offset", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/re_lu/Relu", "op": "_FusedConv2D", "input": ["input_1", "StatefulPartitionedCall/Mobile_Unet/conv2d/Conv2D_weights", "StatefulPartitionedCall/Mobile_Unet/conv2d/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/max_pooling2d/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/Mobile_Unet/re_lu/Relu"], "attr": {"explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/re_lu_1/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Mobile_Unet/max_pooling2d/MaxPool", "StatefulPartitionedCall/Mobile_Unet/conv2d_1/Conv2D_weights", "StatefulPartitionedCall/Mobile_Unet/conv2d_1/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/Mobile_Unet/re_lu_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/re_lu_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Mobile_Unet/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/Mobile_Unet/conv2d_2/Conv2D_weights", "StatefulPartitionedCall/Mobile_Unet/conv2d_2/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/Mobile_Unet/re_lu_2/Relu"], "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/re_lu_3/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Mobile_Unet/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/Mobile_Unet/conv2d_3/Conv2D_weights", "StatefulPartitionedCall/Mobile_Unet/conv2d_3/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["StatefulPartitionedCall/Mobile_Unet/re_lu_3/Relu"], "attr": {"padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/tf.image.resize/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/Mobile_Unet/max_pooling2d_3/MaxPool", "unknown_23"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/tf.concat/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/Mobile_Unet/tf.image.resize/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/Mobile_Unet/max_pooling2d_2/MaxPool", "StatefulPartitionedCall/Mobile_Unet/tf.concat/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/re_lu_4/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Mobile_Unet/tf.concat/concat", "StatefulPartitionedCall/Mobile_Unet/conv2d_4/Conv2D_weights", "StatefulPartitionedCall/Mobile_Unet/conv2d_4/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/tf.image.resize_1/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/Mobile_Unet/re_lu_4/Relu", "unknown_30"], "attr": {"T": {"type": "DT_FLOAT"}, "align_corners": {"b": false}, "half_pixel_centers": {"b": true}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/tf.concat_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/Mobile_Unet/tf.image.resize_1/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/Mobile_Unet/max_pooling2d_1/MaxPool", "StatefulPartitionedCall/Mobile_Unet/tf.concat_1/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/re_lu_5/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Mobile_Unet/tf.concat_1/concat", "StatefulPartitionedCall/Mobile_Unet/conv2d_5/Conv2D_weights", "StatefulPartitionedCall/Mobile_Unet/conv2d_5/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "epsilon": {"f": 0.0}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/tf.image.resize_2/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/Mobile_Unet/re_lu_5/Relu", "unknown_37"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/tf.concat_2/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/Mobile_Unet/tf.image.resize_2/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/Mobile_Unet/max_pooling2d/MaxPool", "StatefulPartitionedCall/Mobile_Unet/tf.concat_2/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/re_lu_6/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Mobile_Unet/tf.concat_2/concat", "StatefulPartitionedCall/Mobile_Unet/conv2d_6/Conv2D_weights", "StatefulPartitionedCall/Mobile_Unet/conv2d_6/Conv2D_bn_offset"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/tf.image.resize_3/resize/ResizeNearestNeighbor", "op": "ResizeNearestNeighbor", "input": ["StatefulPartitionedCall/Mobile_Unet/re_lu_6/Relu", "unknown_44"], "attr": {"align_corners": {"b": false}, "half_pixel_centers": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_7/BiasAdd", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/Mobile_Unet/tf.image.resize_3/resize/ResizeNearestNeighbor", "StatefulPartitionedCall/Mobile_Unet/conv2d_7/Conv2D/ReadVariableOp", "StatefulPartitionedCall/Mobile_Unet/conv2d_7/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "U0FNRQ=="}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_7/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/Mobile_Unet/conv2d_7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/Mobile_Unet/conv2d_7/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/Mobile_Unet/reshape/Shape", "StatefulPartitionedCall/Mobile_Unet/reshape/strided_slice/stack", "StatefulPartitionedCall/Mobile_Unet/reshape/strided_slice/stack_1", "StatefulPartitionedCall/Mobile_Unet/reshape/strided_slice/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/Mobile_Unet/reshape/strided_slice", "StatefulPartitionedCall/Mobile_Unet/reshape/Reshape/shape/1", "StatefulPartitionedCall/Mobile_Unet/reshape/Reshape/shape/2", "StatefulPartitionedCall/Mobile_Unet/reshape/Reshape/shape/3"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/Mobile_Unet/conv2d_7/Sigmoid", "StatefulPartitionedCall/Mobile_Unet/reshape/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/Mobile_Unet/reshape/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 898}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown_23", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/tf.concat/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_30", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/tf.concat_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_37", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/tf.concat_2/concat/axis", "shape": [], "dtype": "int32"}, {"name": "unknown_44", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_7/Conv2D/ReadVariableOp", "shape": [1, 1, 48, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_7/BiasAdd/ReadVariableOp", "shape": [1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/reshape/Reshape/shape/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d/Conv2D_weights", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d/Conv2D_bn_offset", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_6/Conv2D_weights", "shape": [3, 3, 112, 48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_1/Conv2D_weights", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_1/Conv2D_bn_offset", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_6/Conv2D_bn_offset", "shape": [48], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_2/Conv2D_weights", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_2/Conv2D_bn_offset", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_3/Conv2D_weights", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_3/Conv2D_bn_offset", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_4/Conv2D_weights", "shape": [3, 3, 192, 192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_4/Conv2D_bn_offset", "shape": [192], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_5/Conv2D_weights", "shape": [3, 3, 224, 96], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Mobile_Unet/conv2d_5/Conv2D_bn_offset", "shape": [96], "dtype": "float32"}]}]}